resource "iosxe_interface_ethernet" "tw1_0_2" {
  type = "TwentyFiveGigE"
  name = "1/0/2"
  shutdown = false
  description = "test desc"
}




iosxe_system.general: Refreshing state... [id=Cisco-IOS-XE-native:native]
iosxe_vlan.vlan_100: Refreshing state... [id=Cisco-IOS-XE-native:native/vlan/Cisco-IOS-XE-vlan:vlan-list=100]
iosxe_interface_switchport.tw1_0_1: Refreshing state... [id=Cisco-IOS-XE-native:native/interface/TwentyFiveGigE=1%2F0%2F1/switchport-config/switchport]
iosxe_vlan.vlan_101: Refreshing state... [id=Cisco-IOS-XE-native:native/vlan/Cisco-IOS-XE-vlan:vlan-list=101]
iosxe_access_list_standard.allowed_all: Refreshing state... [id=Cisco-IOS-XE-native:native/ip/access-list/Cisco-IOS-XE-acl:standard=allow_all]
iosxe_template.en_trunk: Refreshing state... [id=Cisco-IOS-XE-native:native/template/Cisco-IOS-XE-template:template_details=Port_802.1x]
iosxe_banner.banner: Refreshing state... [id=Cisco-IOS-XE-native:native/banner]
iosxe_username.userbase: Refreshing state... [id=Cisco-IOS-XE-native:native/username=userbase]
iosxe_username.usertest: Refreshing state... [id=Cisco-IOS-XE-native:native/username=testuser]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # iosxe_interface_ethernet.tw1_0_2 will be created
  + resource "iosxe_interface_ethernet" "tw1_0_2" {
      + channel_group_mode             = (known after apply)
      + channel_group_number           = (known after apply)
      + description                    = "test desc"
      + encapsulation_dot1q_vlan_id    = (known after apply)
      + id                             = (known after apply)
      + ip_access_group_in             = (known after apply)
      + ip_access_group_in_enable      = true
      + ip_access_group_out            = (known after apply)
      + ip_access_group_out_enable     = true
      + ip_dhcp_relay_source_interface = (known after apply)
      + ipv4_address                   = (known after apply)
      + ipv4_address_mask              = (known after apply)
      + media_type                     = (known after apply)
      + name                           = "1/0/2"
      + shutdown                       = false
      + switchport                     = (known after apply)
      + type                           = "TwentyFiveGigE"
      + unnumbered                     = (known after apply)
      + vrf_forwarding                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
iosxe_interface_ethernet.tw1_0_2: Creating...
iosxe_interface_ethernet.tw1_0_2: Still creating... [10s elapsed]
iosxe_interface_ethernet.tw1_0_2: Still creating... [20s elapsed]
╷
│ Error: Client Error
│ 
│   with iosxe_interface_ethernet.tw1_0_2,
│   on iosxe_int_ethernet.tf line 5, in resource "iosxe_interface_ethernet" "tw1_0_2":
│    5: resource "iosxe_interface_ethernet" "tw1_0_2" {
│ 
│ Failed to configure object (PATCH), got error: HTTP Request failed: StatusCode 400, RESTCONF errors
│ {Error:[{ErrorType:application ErrorTag:invalid-value ErrorAppTag:
│ ErrorPath:/Cisco-IOS-XE-native:native/interface/TwentyFiveGigE ErrorMessage:inconsistent value: Device refused one or
│ more commands ErrorInfo:}]} {PatchId: GlobalStatus:{Ok:false Errors:{Error:[]}} EditStatus:{Edit:[]}}

